Revit 2024 API
BuiltInFailures.DPartFailures.DivideVolumesSketchesWithProfileUnfriendlyCurves Property
 Sketch contains curves to which profiles cannot be applied or chains of curves.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DivideVolumesSketchesWithProfileUnfriendlyCurves { get; }
Visual Basic
Public Shared ReadOnly Property DivideVolumesSketchesWithProfileUnfriendlyCurves As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DivideVolumesSketchesWithProfileUnfriendlyCurves {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace